[
    {
        "ques": "What is the best time to visit Delhi?",
        "ans": "The best time to visit Delhi is from October to March when the weather is pleasant and suitable for sightseeing."
    },
    {
        "ques": "What are the transportation options available in Delhi?",
        "ans": "Delhi has a variety of transportation options including metro, buses, auto-rickshaws, taxis, and app-based ride services like Uber and Ola."
    },
    {
        "ques": "Is Delhi safe for tourists?",
        "ans": "Delhi is generally safe for tourists, but it's advisable to stay cautious, avoid isolated areas at night, and keep your belongings secure."
    },
    {
        "ques": "What are the local laws and regulations tourists should be aware of?",
        "ans": "Tourists should respect local customs, avoid public displays of affection, not carry or use drugs, and carry a copy of their passport and visa at all times."
    },
    {
        "ques": "What is the currency used in Delhi and where can I exchange money?",
        "ans": "The currency used is the Indian Rupee (INR). Money can be exchanged at airports, banks, and authorized exchange centers."
    },
    {
        "ques": "Are credit cards widely accepted in Delhi?",
        "ans": "Credit cards are widely accepted in hotels, restaurants, and larger stores. However, it's advisable to carry some cash for small purchases and in local markets."
    },
    {
        "ques": "What are the emergency contact numbers in Delhi?",
        "ans": "For police, dial 100; for fire services, dial 101; for medical emergencies, dial 102; and for women's helpline, dial 1091."
    },
    {
        "ques": "How can I ensure food and water safety in Delhi?",
        "ans": "It's recommended to drink bottled water, avoid street food from unhygienic places, and eat at reputable restaurants to ensure food safety."
    },
    {
        "ques": "What should I do in case of a medical emergency?",
        "ans": "In case of a medical emergency, you can visit any of the major hospitals like AIIMS, Fortis, or Apollo. You can also dial 102 for an ambulance."
    },
    {
        "ques": "Are there any specific dress codes to follow in Delhi?",
        "ans": "While there is no strict dress code, it's advisable to dress modestly, especially when visiting religious sites."
    },
    {
        "ques": "Is tipping expected in Delhi?",
        "ans": "Tipping is appreciated but not mandatory. In restaurants, a tip of 10% of the bill is usually considered appropriate."
    },
    {
        "ques": "What are the shopping hours in Delhi?",
        "ans": "Most shops in Delhi are open from 10 AM to 8 PM, although timings may vary. Markets are usually closed on Mondays."
    },
    {
        "ques": "How can I stay connected to the internet in Delhi?",
        "ans": "You can stay connected through Wi-Fi available in hotels, cafes, and restaurants. Alternatively, you can purchase a local SIM card with data."
    },
    {
        "ques": "Are there any cultural etiquettes I should be aware of in Delhi?",
        "ans": "Yes, it's polite to remove your shoes before entering someone's home or a temple, greet people with a 'Namaste', and avoid touching anyone with your feet."
    }
]